app/controllers/clients_controller.rb

SELECT count(*) AS count_all FROM "clients"
SELECT * FROM "clients" ORDER BY name ASC LIMIT 25 OFFSET 0
---
  def index
    @list_nav = ListNav.new(params, list_nav,
      { :default_sort_field => 'name',
        :default_sort_direction => 'ASC',
        :limit => PER_PAGE })
    @list_nav.count = Client.count(:conditions => @list_nav.conditions)
    @clients = Client.all(:conditions => @list_nav.conditions,
                          :order      => @list_nav.order,
                          :limit      => @list_nav.limit,
                          :offset     => @list_nav.offset)

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def show
    @client = Client.find(params[:id])

INSERT INTO "clients" ("name", "city", "postal_code", "lng", "address_1", "address_2", "lat", "state") VALUES('Google', 'Wichita', '27606', -97.2872963, '1000 N Bluff Street', '', 37.6709549, 'KS')
---
  def create
    @client = Client.new(params[:client])
    if @client.save