app/controllers/dashboard_controller.rb

  def index
    if client_user?
      pickup_includes = [:pickup_location]
    else
      pickup_includes = [:pickup_location, :client]
      @recent_feedback = Feedback.recent
    end

    # Requested Pickups
    if client_user?
      rpc = ['status = ? AND client_id = ?', 'Requested', @client.id]
    else
      rpc = ['status = ?', 'Requested']
    end
    @requested_pickups = Pickup.all(
      :include => pickup_includes,
      :conditions => rpc,
      :order => 'pickup_date ASC')
---
SELECT * FROM "pickups" WHERE (status IN ('Picked Up','Arrived','Sanitized','Audited','Invoiced')) ORDER BY pickup_date ASC

  def calendar
    if params[:year] && params[:month]
      @date = Date.civil(params[:year].to_i, params[:month].to_i)
    else
      @date = Date.today
    end
    @prev = @date.last_month
    @next = @date.next_month
    conditions = [
      "((YEAR(pickup_date) = ? AND MONTH(pickup_date) = ?) OR " \
        "(YEAR(pickup_date) = ? AND MONTH(pickup_date) = ?) OR " \
        "(YEAR(pickup_date) = ? AND MONTH(pickup_date) = ?))",
      @date.year, @date.month,
      @prev.year, @prev.month,
      @next.year, @next.month
    ]
    if client_user?
      conditions[0] << ' AND client_id = ?'
      conditions    << @client.id
    end
    # @pickups = Pickup.all(:conditions => conditions, :order => 'pickup_date ASC')
    @pickups = Pickup.all
---
SELECT * FROM "pickups"