app/controllers/equipment_controller.rb

  def index
    if @container.is_a?(Client)
      equipment_includes = [:pickup]
    else
      equipment_includes = []
    end
    @list_nav = ListNav.new(params, list_nav,
      { :default_sort_field => 'type_name',
        :default_sort_direction => 'ASC',
        :limit => PER_PAGE })
    @list_nav.count = @container.equipment.count(:conditions => @list_nav.conditions, :include => equipment_includes)
    @equipment = @container.equipment.all(
      :include => equipment_includes,
      :conditions => @list_nav.conditions,
      :order      => @list_nav.order,
      :limit      => @list_nav.limit,
      :offset     => @list_nav.offset)
---
SELECT count(DISTINCT "equipment".id) AS count_all FROM "equipment" LEFT OUTER JOIN "pickups" ON "pickups".id = "equipment".pickup_id WHERE ("equipment".client_id = 1)
SELECT * FROM "equipment" WHERE ("equipment".client_id = 1) ORDER BY type_name ASC LIMIT 25 OFFSET 0