app/controllers/pallets_controller.rb

SELECT * FROM "pallets"
---
  def index
    @pallets = Pallet.all

INSERT INTO "pallets" ("number", "created_at", "comments", "updated_at", "weight", "description") VALUES('1', '2011-06-21 19:13:29', 'just lookin', '2011-06-21 19:13:29', '100 lbs', 'contains laptops')
---
  def create
    @pallet = Pallet.new(params[:pallet])

    if @pallet.save