app/controllers/pickups_controller.rb

  def index
    pickup_includes = [:pickup_location]
    if solution_owner_user?
      conditions = '1'
      pickup_includes << :client
    else
      conditions = ['pickups.client_id = ?', @client.id]  if @client
    end

    @list_nav = ListNav.new(params, list_nav,
      { :default_sort_field => 'pickup_date',
        :default_sort_direction => 'DESC',
        :limit => PER_PAGE,
        :conditions => conditions })
    @list_nav.count = Pickup.count(:conditions => @list_nav.conditions, :include => pickup_includes)
    @pickups = Pickup.all(
      :include    => pickup_includes,
      :conditions => @list_nav.conditions,
      :order      => @list_nav.order,
      :limit      => @list_nav.limit,
      :offset     => @list_nav.offset)
---
SELECT count(DISTINCT "pickups".id) AS count_all FROM "pickups" LEFT OUTER JOIN "pickup_locations" ON "pickup_locations".id = "pickups".pickup_location_id LEFT OUTER JOIN "clients" ON "clients".id = "pickups".client_id WHERE (1)
SELECT * FROM "pickups" WHERE (1) ORDER BY pickup_date DESC LIMIT 25 OFFSET 0

  def update_users_list
    render :update do |page|
      pickup_location = PickupLocation.find(params[:pickup_location_id])
      client_users = pickup_location.client.client_users.all(:order => 'name ASC')
---
SELECT * FROM "pickup_locations" WHERE ("pickup_locations"."id" = 1)
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "users" WHERE ("users".client_id = 1) AND ( ("users"."type" = 'ClientUser' ) ) ORDER BY name ASC

  def edit
    @pickup = Pickup.find(params[:id])
---
SELECT * FROM "pickups" WHERE ("pickups"."id" = 1)

  def create
    @pickup = Pickup.new(params[:pickup])
    @pickup.status = 'Acknowledged'
    @pickup.created_by = current_user
---
INSERT INTO "pickups" ("name", "special_request", "created_at", "quantity", "pickup_time", "client_reference", "created_by_id", "pickup_location_id", "notification_date", "pickup_date_range", "facility", "crew_members", "client_id", "site_contact_name", "departure_time", "solution_owner_user_id", "client_user_id", "pickup_date", "number_of_men", "status", "pickup_type", "arrival_time") VALUES('Test Pickup 4', 'asfasd', '2011-06-21 01:31:33', 'adfad', 'dfasd', '9457', 1, 2, '2011-06-20', NULL, 'Tyrone', 'dfafa', 1, 'Isabella', 'adfa', 1, 3, '2011-06-21', '3', 'Acknowledged', 'Digital Data Destruction,Physical Data Destruction,Environment Lot Certificate', 'adfad')

  def update
    @pickup = Pickup.find(params[:id])

    respond_to do |format|
      if @pickup.update_attributes(params[:pickup])
---
SELECT * FROM "pickups" WHERE ("pickups"."id" = 2)
UPDATE "pickups" SET "pickup_type" = 'Digital Data Destruction,Physical Data Destruction,Certified Asset Tag Removal' WHERE "id" = 2

  def destroy
    get_pickup
    if solution_owner_user?
      @pickup.destroy
---
DELETE FROM "pickups" WHERE "id" = 1