app/controllers/pickup_locations_controller.rb

  def index
    if solution_owner_user?
      conditions = '1'
    else
      conditions = ['pickup_locations.client_id = ?', @client.id] if @client
    end
    @list_nav = ListNav.new(params, list_nav,
      { :default_sort_field => 'pickup_locations.name',
        :default_sort_direction => 'ASC',
        :limit => PER_PAGE,
        :conditions => conditions })
    @list_nav.count = PickupLocation.count(:conditions => @list_nav.conditions,
      :include => [:client, :client_user])
    @pickup_locations = PickupLocation.all(
      :include    => [:client, :client_user],
      :conditions => @list_nav.conditions,
      :order      => @list_nav.order,
      :limit      => @list_nav.limit,
      :offset     => @list_nav.offset)
---
SELECT * FROM "users" WHERE ("users"."id" = 3) AND ( ("users"."type" = 'ClientUser' ) )
SELECT count(DISTINCT "pickup_locations".id) AS count_all FROM "pickup_locations" LEFT OUTER JOIN "clients" ON "clients".id = "pickup_locations".client_id LEFT OUTER JOIN "users" ON "users".id = "pickup_locations".client_user_id AND ("users"."type" = 'ClientUser' ) WHERE (1)
SELECT * FROM "pickup_locations" WHERE (1) ORDER BY pickup_locations.name ASC LIMIT 25 OFFSET 0

  def show
    @pickup_location = PickupLocation.find(params[:id])
---
SELECT * FROM "pickup_locations" WHERE ("pickup_locations"."id" = 1)

  def update_client_users_list
    render :update do |page|
      users = Client.find(params[:client_id]).client_users
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "users" WHERE ("users".client_id = 1) AND ( ("users"."type" = 'ClientUser' ) )

  def create
    @pickup_location = PickupLocation.new(params[:pickup_location])

    respond_to do |format|
      if @pickup_location.save
---
INSERT INTO "pickup_locations" ("name", "city", "postal_code", "lng", "client_id", "address_1", "client_user_id", "address_2", "solution_owner_user_id", "lat", "state") VALUES('Main Office', 'Altanta', '30329', -84.3279093, 1, '1000 Very Rich Lane', 3, '', 1, 33.828105, 'GA')