app/controllers/users_controller.rb

  def index
    if params[:commit] == 'Toggle Inactivity' && params[:user_ids].is_a?(Array)
      params[:user_ids].each do |id|
        user = User.find(id)
        if user != current_user
          user.toggle_inactivity
          msg = "#{user.login} was made #{user.inactive? ? 'in' : ''}active"
          donemark msg
          audit msg
        end
      end
    end
    @list_nav = ListNav.new(params, list_nav,
      { :default_sort_field => 'login',
        :default_sort_direction => 'ASC',
        :limit => PER_PAGE })
    @list_nav.count = User.count(:conditions => @list_nav.conditions, :include => :client)
    @users = User.all(
      :include => :client,
      :conditions => @list_nav.conditions,
      :order      => @list_nav.order,
      :limit      => @list_nav.limit,
      :offset     => @list_nav.offset)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT count(DISTINCT "users".id) AS count_all FROM "users" LEFT OUTER JOIN "clients" ON "clients".id = "users".client_id
SELECT * FROM "users" ORDER BY login ASC LIMIT 25 OFFSET 0

  def create
    @user = if params[:user][:client_id].blank?
      SolutionOwnerUser.new(params[:user])
    else
      ClientUser.new(params[:user])
    end

    @user.admin = 1 if params[:user][:admin] == '1'

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "title", "last_login", "crypted_password", "remember_token_expires_at", "admin", "inactive", "type", "client_id", "phone", "breadcrumbs", "remember_token", "time_zone", "login", "email") VALUES('Customer', 'dc7fba34d06204ed3bc381d510a54cd5a882e2ae', '2011-06-20 22:43:07', 'CEO', NULL, 'ee12a3269ce8a08ea2569064c08d3eb4d8d4a418', NULL, 0, 0, 'SolutionOwnerUser', NULL, '', '--- []